OdDeviationParams.getMaxPerCircle
\details
Retrieves the current maximum number of circle segments.
\returns Returns an unsigned 16-bit integer value that represents the current maximum quantity of circle segments.

OdDeviationParams.getMinPerCircle
\details
Retrieves the current minimum number of circle segments.
\returns Returns an unsigned 16-bit integer value that represents the current minimum quantity of circle segments.

OdDeviationParams.getDeviation
\details
Retrieves the current deviation value.
\returns Returns a double value that represents the current deviation value.

OdDeviationParams.#ctor(System.Double,System.UInt16,System.UInt16)
\details
Creates a new set of deviation parameters with the specified values.
\param deviation    [in] A deviation value.
\param minPerCircle [in] A minimum number of segments to divide the circle into.
\param maxPerCircle  [in] A maximum number of segments to divide the circle into.

OdDeviationParams
\details
A class that implements working with STEP deviation parameters.